package banana;

import static banana.Logic.*;

public class Test269 {
	public static void main( String[] args ) {
		
		// 사다리를 만들어 보자.
		int[][] map = {
			{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
			{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
			{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
			{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
			{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
			{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
			{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
			{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
			{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
			{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
			{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
			{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
			{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
			{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
			{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
			{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
			{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
			{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
			{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
			{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
		};
		
		map[0][4] = 1;
		map[4][5] = map[5][4] = 1;
		map[4][8] = 1;
		map[8][16] = 1;
		map[5][9] = 1;
		map[9][12] = 1;
		map[9][13] = map[13][9] =  1;
		map[12][14] = 1;
		map[14][17] = 1;
		map[2][6] = 1;
		map[6][10] = 1;
		map[10][13] = 1;
		map[13][15] = 1;
		map[15][18] = 1;
		map[10][11] = map[11][10] = 1;
		map[3][7] = 1;
		map[7][11] = 1;
		map[11][19] = 1;
		map[14][15] = map[15][14] = 1;
		map[6][7] = map[7][6] = 1;
		map[8][12] = map[12][8] = 1;
		
		
		boolean[] visited = new boolean[20];

		visit( 2, visited, map );    // 3번에서 시작
	}
}

class Logic {
	/*
		visit(0)
			visited : 0
			visit(2)
				visited : 2
				visit(3)
					visited : 3
					visit(6)
						visited : 6
							재귀호출 할 게 없다. 원랜 위로 올라가지만, break를 넣음.(끝)
	*/

	public static void visit(int spot, boolean[] visited, int[][] map){
		visited[spot] = true;
		System.out.println("visit :" + spot);
		
		if( i == 13){    // 이 위치가 가장 적절하다고 한다. 이유는 모르겠음..
						System.out.println("폭탄 터짐");
						break;
					}
		
		for(int i=0; i<map[spot].length; i++){
			if(map[spot][i] != 0){
				if(visited[i] == false){
					visit(i, visited, map);
					break;    // 이러면 마지막에 4가 뜨던게 안 뜬다.
				}
			}
		}
	}

}

/*
	특정 스팟에 도달하면 폭탄이 터지게 하려면 어떻게 해야 할까?
*/