
/*
	00001010 : 10
	00010100 : 20 ( 16 + 4 )
	00101000 : 40 ( 32 + 8 )
	한번 왼쪽으로 밀 때마다 *2를 한 효과가 나온다.
	
	00001010 : 10
	00000101 : 5
	00000010 : 2
	한번 오른쪽으로 밀 때마다 /2를 한 효과.
*/


public class Test196{
	public static void main(String[] args){
		int i = 10;
		System.out.println(i<<2);
		System.out.println(i>>2);
	}
}

/*
	>> << >>> : 쉬프트 오퍼레이터 (이진수의 비트정보를 밀어주는 식으로 동작)
	
	0000 1010
	
	0001 : 1
	0010 : 2
	0011 : 3
	0100 : 4
	0101 : 5
	0110 : 6
	0111 : 7
	1000 : 8
	1001 : 9
	1010 : 10 A
	1011 : 11 B
	1100 : 12 C
	1101 : 13 D
	1110 : 14 E
	1111 : 15 F
	
	16진수 : 한자리가 0~15까지 표기가 가능한 숫자체계
	16진수는 왜 나왔나? 2진수로 옮기기가 너무 편하기 때문. 0xA8 - 1010 1000 0x9F - 1001 1111
	
	0x86 - 1000 0110
	0xFF - 1111 1111
*/